[
    {
        "version": "1.3.0",
        "date": "2019-02-28",
        "message": "Search performance and usability fixes and additions",
        "added": [
            "Added a project filter to task view. You can now select multiple projects to filter by.",
            "Now app defaults new tasks to be self assigned",
            "Added natural text search(through global search) to tasks. Fields must be enabled for global search for this to work on the server.",
            "Added check to see if user still has a valid session and display login screen if not."
        ],
        "changed": [
            "Refactored task rendering to reduce complexity and improve perfomance. Now tasks are rendered progressively to avoid jitter and cpu thrashing.",
            "Fixed issue where after creating a new task the app would display an empty view",
            "Fixed issue where frappe's auto log off would cause query error. App will now actively try to keep a seesion open by pinging server over a few minutes interval while the app is running."
        ]
    },
    {
        "version": "1.2.3",
        "date": "2019-02-12",
        "message": "Idle time and Bug fixes",
        "added": [
            "Added idle time message after 10 minutes of idle time."
        ],
        "changed": [
            "Fixed regression issue where employee_name wasn't passed to backend queries causing tasks to be tracked by no employee.",
            "Fixed issue where task time ticker stoped working after task search functionality was introduced.",
            "Refactored component update methodology to accomodate idle messaging."
        ]
    },
    {
        "version": "1.2.2",
        "date": "2019-01-30",
        "message": "Minor UI Improvements",
        "added": [
            "Included past change logs on change log display for unseen intermediate updates."
        ], 
        "changed": [
            "Refactored search throttling scheme to improve UI performance.",
            "Moved Task search to its own contaier as to keep in view while scrolling tasks.",
            "Fixed small issue with search spinner hiding behind search bar while typing.",
            "Refactored avatar to cache user info as to lower network calls.",
            "Refactored avatar component to simplify it and avoid redraw."
        ]
    }, {
        "version": "1.2.0",
        "date": "2019-01-28",
        "message": "More QOL improvements!",
        "added": [
            "You can now filter out tasks assigned to you. This is now the default.",
            "Fast search query! Added debouncing and api throttling to improve UI stutter.",
            "Tasks search spinner now appears while you type out your queries for live fetching.",
            "Added avatar fetching from server.",
            "Added assigned tasks priority sorting so they always appear at the top of the list.",
            "Added transitions to task cards while they load to minimize UI jumps."
        ], 
        "changed": [
            "Moved tasks tab to its own root menu. Makes moving around less tedious."
        ]
    },    {
        "version": "1.1.0",
        "date": "2019-01-23",
        "message": "QoL update. It was all about the settings baby!",
        "added": [
            "Settings Page.",
            "Quit button in settings page.",
            "Logout button in settings page.",
            "Global visibility shortcut customization with mac, pc, linux detection.",
            "You can now define what happens when a timer starts, either navigate to timesheet or stay in tasks.",
            "Tasks has a new search field. For now it is a simple character match search. Will add fuzzy search in a future update.",
            "Added user toast message. Right now only used on settings to inform user when shortcut keys were successfully set on the OS."
        ], 
        "changed": [
            "How settings are stored and managed internally.",
            "Expanded main process api to handle more of the system configurations outside of the app rendering."
        ]
    },    {
        "version": "1.0.26",
        "date": "2019-01-22",
        "message": "Small mac fix.",
        "changed": [
            "Fix: Syntax error on mac builds due to electron versions."
        ]
    }, {
        "version": "1.0.25",
        "date": "2019-01-17",
        "message": "On this update, focus on bug fixes and small UI updates to make timeline more usable",
        "added": [
            "Timeline time blocks now have a cog icon.",
            "Time block menu new open timesheet on browser link",
            "Time block menu new open task on browser link",
            "Time block menu new Stop timer action",
            "Time block menu new delete entry action",
            "Electron url navigation blocked from going anywhere outside of our own protocols",
            "Doctype:// protocol can open specific doctypes on browser"
        ],
        "changed": [
            "Fix: employee id was not passed correctly to app and query causing all users to see each other's entries."
        ]
    },
    {
        "version": "1.0.24",
        "date": "2019-01-16",
        "message": "Small library version updates to keep timer moving with its dependencies.",
        "changed": [
            "Fixes bug where MacOS dock api was causing issues on Windows",
            "Updated react dependencies.",
            "Updated @blueprintjs/core to 3.11.0",
            "Updated @blueprintjs/datetime to 3.6.0",
            "Updated @blueprintjs/select to 3.5.0",
            "Updated @blueprintjs/table to 3.4.0",
            "Updated ESM module to 3.1.0",
            "Updated nwb to version 0.23.0",
            "Updated react to 16.7.0",
            "Updated react-dom to 16.7.0",
            "Updated react-hot-loader to 4.6.3",
            "Updated react-measure to 2.2.2"
        ]
    },
    {
        "version": "1.0.23",
        "date": "2019-01-15",
        "message": "Hi Friendos! on this update the focus was on UI polish and consistency.",
        "added": [
            "Changelog screen before login.",
            "New Mac OS app badge timer. On timer start/stop the app icon will display the active timer."
        ],
        "changed": [
            "Titlebar style not hidden anymore so app can be dragged and resized on Mac OS version.",
            "Login screen now remembers your inputs so they don't get wiped out on login errors.",
            "Global show/display shortcut will now move the app window to another screen instead of automatically hiding the app. To hide the app the mouse must be placed on the same screen as the app.",
            "Updated electron, electron-builder and updater to fix auto update issues."
        ],
        "removed": [
            "Sentry api generation tool stores project token keys right in project root. Removed exposed key and file from project."
        ]
    }
]